
[winlogbeat:json]
CHARSET = UTF-8
KV_MODE = json
LINE_BREAKER = ([\r\n]+)
NO_BINARY_CHECK = 1
SHOULD_LINEMERGE = false
TIME_PREFIX = \"\@timestamp\"\:\"
TIME_FORMAT = %Y-%m-%dT%H:%M:%S.%3N
MAX_TIMESTAMP_LOOKAHEAD = 40
category = Custom
pulldown_type = 1
FIELDALIAS-winlog_event_data = "winlog.channel" ASNEW channel "winlog.computer_name" ASNEW dest "winlog.event_data.AuthenticationPackageName" ASNEW AuthenticationPackageName "winlog.event_data.ElevatedToken" ASNEW ElevatedToken "winlog.event_data.FailureReason" ASNEW FailureReason "winlog.event_data.IpAddress" ASNEW src_ip "winlog.event_data.IpPort" ASNEW src_port "winlog.event_data.KeyLength" ASNEW KeyLength "winlog.event_data.LmPackageName" ASNEW LmPackageName "winlog.event_data.LogonGuid" ASNEW LogonGuid "winlog.event_data.LogonProcessName" ASNEW LogonProcessName "winlog.event_data.RestrictedAdminMode" ASNEW RestrictedAdminMode "winlog.event_data.ServiceName" ASNEW ServiceName "winlog.event_data.ServiceSid" ASNEW ServiceSid "winlog.event_data.Status" ASNEW Status "winlog.event_data.SubStatus" ASNEW SubStatus "winlog.event_data.SubjectDomainName" ASNEW SubjectDomainName "winlog.event_data.SubjectLogonId" ASNEW SubjectLogonId "winlog.event_data.SubjectUserName" ASNEW SubjectUserName "winlog.event_data.SubjectUserSid" ASNEW SubjectUserSid "winlog.event_data.TargetDomainName" ASNEW Group_Domain "winlog.event_data.TargetLinkedLogonId" ASNEW TargetLinkedLogonId "winlog.event_data.TargetOutboundDomainName" ASNEW TargetOutboundDomainName "winlog.event_data.TargetOutboundUserName" ASNEW TargetOutboundUserName "winlog.event_data.TargetUserName" ASNEW Group_Name "winlog.event_data.TargetUserSid" ASNEW TargetUserSid "winlog.event_data.TicketEncryptionType" ASNEW TicketEncryptionType "winlog.event_data.TicketOptions" ASNEW TicketOptions "winlog.event_data.TransmittedServices" ASNEW TransmittedServices "winlog.event_data.VirtualAccount" ASNEW VirtualAccount "winlog.event_data.WorkstationName" ASNEW WorkstationName "winlog.event_id" ASNEW EventCode "winlog.keywords{}" ASNEW keywords "winlog.opcode" ASNEW opcode "winlog.process.pid" ASNEW pid "winlog.record_id" ASNEW RecordNumber "winlog.task" ASNEW task
EVAL-action = if(keywords=="Audit Success","success",if(keywords=="Audit Failure","failure","unkown"))
EVAL-product = "Windows"
EVAL-vendor = "Microsoft"
EVAL-ta_winlogbeat_action = case(upper(Status) == "0XC000006F", "denied", upper(Status) == "0XC0000070", "denied", upper(Status) == "0XC000015B", "denied", upper(Status) == "0XC0000234", "denied", upper(Status) == "0XC0000064", "unknown", upper(Status) == "0XC0000133", "error", upper(Status) == "0XC0000225", "error", 1=1 , "failure")
EVAL-signature_id = if(SourceName="Microsoft-Windows-WindowsUpdateClient",signature_id,EventCode)
EVAL-body = coalesce('signature_message','Message')
EVAL-user_group = coalesce(Group_Name,New_Account_Name,Target_Account_Name)
EVAL-dest_nt_domain = nullif(dest_nt_domain,"-")
